---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextAlignment
source: html/23818f23-be7a-1ffd-3f0d-3b1513dfc1c5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextAlignment Property

"Text Alignment"

## Syntax (C#)
```csharp
public static ForgeTypeId TextAlignment { get; }
```